wpirri/pic32mmBoot/Programa/main.c
    // Initialize the File System
    if(!FSInit())
    {
        Log("No se pudo montar la terjeta SD\n");
        /* Si no puedo iniciaizar la SD trato de saltar al programa */
        if(ValidAppPresent())
        {
            Log("Iniciando programa previamente cargado\n");
            JumpToApp();
        }
        else
        {
            //Indicate error and stay in while loop.
            Log("No hay programa cargado\n");
            Error(1);
        }
    }         

    STATUS_LED = 1;
    
    /* Siempre que haya un archivo en la SD lo cargo */
    g_boot_file = FSfopen(PROGRAM_FILE_NAME, "r");

    if(g_boot_file == NULL)// Make sure the file is present.
    {
        Log("La tarjeta SD no tiene PGM.HEX\n");
        if(ValidAppPresent())
        {
            Log("Iniciando programa previamente cargado\n");
            JumpToApp();
        }
        else
        {
            /* Trato de abrir un bacup */
            g_boot_file = FSfopen(PROGRAM_FILE_NAME_BK, "r");

            if(g_boot_file == NULL)// Make sure the file is present.
            {
                Log("La tarjeta SD no tiene PGMBK.HEX\n");
                //Indicate error and stay in while loop.
                Error(2);
            }
        }
    }     

    Log("PGM.HEX encontrado\n");
    MODE_LED = 1;

#ifdef VERIFY_PROGRAM
    Log("Verificando archivo PGM.HEX\n");
    /* Verifico el archivo HEX */
    bytecount = 0;
    readretry = READ_RETRY;
    while(readretry && bytecount < g_boot_file->size && validHex == 0)
    {
        while((byteread = readLine(g_ascii_buffer, 80, g_boot_file)) > 0)
        {
            /* Cada vez que leo bien reseteo el contador de errores */
            readretry = READ_RETRY;
            /* Voy contando lo bytes leidos */
            bytecount += byteread;
            /* Salt?o los ':' iniciales */
            ConvertAsciiToHex(&g_ascii_buffer[1],g_hex_rec);

            if( CheckHexRecord(g_hex_rec))
            {
                validHex = 1;
                break;
            }
            // Blink LED
            BlinkLed(300);
        }//while(1)

        /* Me fijo si ley? todo */
        if(readretry && bytecount < g_boot_file->size && validHex == 0)
        {
            readretry--;
            /* Cierro el archivo */
            FSfclose(g_boot_file);
            /* Lo vuelvo a abrir */
            g_boot_file = FSfopen(PROGRAM_FILE_NAME, "r");
            if( !g_boot_file) g_boot_file = FSfopen(PROGRAM_FILE_NAME_BK, "r");
            /* me paro donde se hab?a cortado */
            FSfseek(g_boot_file, bytecount, SEEK_SET);
        }

    }

    STATUS_LED = 0;

    /* Si el HEX no sirve */
    if(validHex == 0)
    {
        Log("Archivo PGM.HEX invalido\n");
        if(ValidAppPresent())
        {
            Log("Iniciando programa previamente cargado\n");
            JumpToApp();
        }
        else
        {
            Log("No hay programa cargado\n");
            //Indicate error and stay in while loop.
            Error(3);
        }
    }

    /* Cierro el archivo */
    FSfclose(g_boot_file);
    Log("PGM.HEX verificado\n");
    /* Lo vuelvo a abrir */
    g_boot_file = FSfopen(PROGRAM_FILE_NAME, "r");
    if( !g_boot_file) g_boot_file = FSfopen(PROGRAM_FILE_NAME_BK, "r");
#endif /* VERIFY_PROGRAM */

    // Erase Flash (Block Erase the program Flash)
    EraseFlash();

    MODE_LED = 0;
    
    Log("Cargando programa\n");
    /* Un parche de reintentos para salvar errores de lectura de las SD */
    bytecount = 0;
    readretry = READ_RETRY;
    while(readretry && bytecount < g_boot_file->size)
    {
        while((byteread = readLine(g_ascii_buffer, 80, g_boot_file)) > 0)
        {
            /* Cada vez que leo bien reseteo el contador de errores */
            readretry = READ_RETRY;
            /* Voy contando lo bytes leidos */
            bytecount += byteread;
            /* Salt?o los ':' iniciales */
            ConvertAsciiToHex(&g_ascii_buffer[1],g_hex_rec);

            if(WriteHexRecord2Flash(g_hex_rec))
            {
                /* Cuando encuentra el registro final sale con 1 */
                Log("Fin de carga de programa\n");
                JumpToApp();
            }
            // Blink LED
            BlinkLed(300);
        }//while(1)

        /* Me fijo si ley? todo */
        if(readretry && bytecount < g_boot_file->size)
        {
            readretry--;
            /* Cierro el archivo */
            FSfclose(g_boot_file);
            /* Lo vuelvo a abrir */
            g_boot_file = FSfopen(PROGRAM_FILE_NAME, "r");
            if( !g_boot_file) g_boot_file = FSfopen(PROGRAM_FILE_NAME_BK, "r");
            /* me paro donde se hab?a cortado */
            FSfseek(g_boot_file, bytecount, SEEK_SET);
        }

    }
    /* Si pasa por ac? es un error en el archivo HEX */
    FSfclose(g_boot_file);
    Log("El bootloader termino sin cargar programa\n");
    Error(4);
    return 0;
}

/******************************************************************************
 * 
 *****************************************************************************/
void BlinkLed(unsigned int period)
{
    if( !((++g_led_count) % period) ) AUX_LED ^= 1;
}

/******************************************************************************
 * 
 *****************************************************************************/
void __attribute__((optimize("-O0"))) Error( unsigned int err )
{
    volatile unsigned long delay_count;
    unsigned int pulse_count;
    unsigned int loop_count;
    /* Valores de err:
     * 1: No hay SD y no hay programa en el micro
     * 2: No hay programa en la SD ni en el micro
     * 3: El programa en la SD no es valido y no hay programa en el micro
     * 4: Error de lectura cargando programa
     * 5: Error de checksum cargando programa
     */
    AUX_LED = 0;
    pulse_count = err;
    loop_count = 10;
    for(delay_count = 1000000; delay_count > 0; delay_count--);
    while(1)
    {
        for(delay_count = 1000000; delay_count > 0; delay_count--);
        if(pulse_count)
        {
            AUX_LED = 1;
            pulse_count--;
        }
        loop_count--;
        for(delay_count = 1000000; delay_count > 0; delay_count--);
        AUX_LED = 0;
        if( !loop_count)
        {
            pulse_count = err;
            loop_count = 10;
        }
    }
}

