wpirri/pic32mmBoot/Programa/main.c
/********************************************************************
* Function: 	JumpToApp( void )
*
* Precondition: 
*
* Input: 		None.
*
* Output:		
*
* Side Effects:	No return from here.
*
* Overview: 	Jumps to application.
*
********************************************************************/
void JumpToApp( void )
{
    void (*fptr)(void);

    STATUS_LED = 1;
    MODE_LED = 1;
    AUX_LED = 0;
    Log("Iniciando...\n");
    for(before_run_delay_count = 10000000; before_run_delay_count > 0; before_run_delay_count--);

    fptr = (void (*)(void))KVA0_TO_KVA1(USER_APP_RESET_ADDRESS);

    __builtin_disable_interrupts();

    fptr();
}

/********************************************************************
* Function: 	ConvertAsciiToHex()
*
* Precondition: 
*
* Input: 		Ascii buffer and hex buffer.
*
* Output:		
*
* Side Effects:	No return from here.
*
* Overview: 	Converts ASCII to Hex.
*
*			
* Note:		 	None.
********************************************************************/
void ConvertAsciiToHex(UINT8* asciiRec, UINT8* hexRec)
{
	UINT8 i = 0;
	UINT8 k = 0;
	UINT8 hex;
	
	
	while((asciiRec[i] >= 0x30) && (asciiRec[i] <= 0x66))
	{
		// Check if the ascci values are in alpha numeric range.
		
		if(asciiRec[i] < 0x3A)
		{
			// Numerical reperesentation in ASCII found.
			hex = asciiRec[i] & 0x0F;
		}
		else
		{
			// Alphabetical value.
			hex = 0x09 + (asciiRec[i] & 0x0F);						
		}
	
		// Following logic converts 2 bytes of ASCII to 1 byte of hex.
		k = i%2;
		
		if(k)
		{
			hexRec[i/2] |= hex;
			
		}
		else
		{
			hexRec[i/2] = (hex << 4) & 0xF0;
		}	
		i++;		
	}		
	
}
// Do not change this
#define FLASH_PAGE_SIZE 0x1000
/********************************************************************
* Function: 	EraseFlash()
*
* Precondition: 
*
* Input: 		None.
*
* Output:		
*
* Side Effects:	No return from here.
*
* Overview: 	Erases Flash (Block Erase).
*
*			
* Note:		 	None.
********************************************************************/
void EraseFlash(void)
{
	uint32_t pFlash;
    INT i;
    char str[256];

    Log("Blanqueando area de programa\n");
    pFlash = (uint32_t)APP_FLASH_BASE_ADDRESS;									
    for( i = 0; i < ((APP_FLASH_END_ADDRESS - APP_FLASH_BASE_ADDRESS + 1)/FLASH_PAGE_SIZE); i++ )
    {
        // Assert on NV error. This must be caught during debug phase.
#ifdef __DEBUG__
        sprintf(str, "Flash Erase Address: 0x%X\n", ( pFlash + (i*FLASH_PAGE_SIZE)));
        Log(str);
#endif
        if( !FLASH_ErasePage( pFlash + (i*FLASH_PAGE_SIZE) ))
        {
           // We have a problem. This must be caught during the debug phase.
            Log("Error al blanquear memoria de programa");
            Error(7);
        } 
        // Blink LED to indicate erase is in progress.
        BlinkLed(10);
    }			           	     
}

/********************************************************************
* Function: 	WriteHexRecord2Flash()
*
* Precondition: 
*
* Input: 		None.
*
* Output:		
*
* Side Effects:	No return from here.
*
* Overview: 	Writes Hex Records to Flash.
*
*			
* Note:		 	None.
********************************************************************/
int WriteHexRecord2Flash(UINT8* HexRecord)
{
    static T_HEX_RECORD HexRecordSt;
    uint32_t WrData0;
    uint32_t WrData1;
    uint32_t ProgAddress;
    UINT8 Checksum = 0;
    UINT8 i;

    HexRecordSt.RecDataLen = HexRecord[0];
    HexRecordSt.RecType = HexRecord[3];
    HexRecordSt.Data = &HexRecord[4];
	
    // Hex Record checksum check.
    for(i = 0; i < HexRecordSt.RecDataLen + 5; i++)
    {
            Checksum += HexRecord[i];
    }
	
    if(Checksum != 0)
    {
        //Error. Hex record Checksum mismatch.
        //Indicate Error by switching ON all LEDs.
        Log("Error de checksum en archivo HEX\n");
        Error(5);
    }
    else
    {
        // Hex record checksum OK.
        switch(HexRecordSt.RecType)
        {
            case DATA_RECORD:  //Record Type 00, data record.
                HexRecordSt.Address.byte.MB = 0;
                HexRecordSt.Address.byte.UB = 0;
                HexRecordSt.Address.byte.HB = HexRecord[1];
                HexRecordSt.Address.byte.LB = HexRecord[2];
                // Derive the address.
                HexRecordSt.Address.Val = HexRecordSt.Address.Val + HexRecordSt.ExtLinAddress.Val + HexRecordSt.ExtSegAddress.Val;
                while(HexRecordSt.RecDataLen) // Loop till all bytes are done.
                {
                    // Convert the Physical address to Virtual address.
                    ProgAddress = (uint32_t)PA_TO_KVA0(HexRecordSt.Address.Val);
                    // Make sure we are not writing boot area and device configuration bits.
                    if(((ProgAddress >= (uint32_t)APP_FLASH_BASE_ADDRESS) && (ProgAddress <= (uint32_t)APP_FLASH_END_ADDRESS))
                       && ((ProgAddress < (uint32_t)DEV_CONFIG_REG_BASE_ADDRESS) || (ProgAddress > (uint32_t)DEV_CONFIG_REG_END_ADDRESS)))
                    {
                        if(ProgAddress & 0x00000007)
                        {
                            /* Second WORD */
                            if(HexRecordSt.RecDataLen < 4)
                            {
                                // Sometimes record data length will not be in multiples of 4. Appending 0xFF will make sure that..
                                // we don't write junk data in such cases.
                                WrData1 = 0xFFFFFFFF;
                                memcpy(&WrData1, HexRecordSt.Data, HexRecordSt.RecDataLen);
                            }
                            else
                            {
                                memcpy(&WrData1, HexRecordSt.Data, 4);
                            }
                            WrData0 = FLASH_ReadWord(ProgAddress - 4);
                            ProgAddress -= 4;
                        }
                        else
                        {
                            /* First WORD */
                            if(HexRecordSt.RecDataLen < 4)
                            {
                                // Sometimes record data length will not be in multiples of 4. Appending 0xFF will make sure that..
                                // we don't write junk data in such cases.
                                WrData0 = 0xFFFFFFFF;
                                memcpy(&WrData0, HexRecordSt.Data, HexRecordSt.RecDataLen);
                            }
                            else
                            {
                                memcpy(&WrData0, HexRecordSt.Data, 4);
                            }
                            WrData1 = FLASH_ReadWord(ProgAddress + 4);
                        }
                        // Write the data into flash.
                        // Assert on error. This must be caught during debug phase.
                        if( !FLASH_WriteDoubleWord(ProgAddress, WrData0, WrData1 ))
                        {
                            Log("Error al escribir programa\n");
                            Error(6);
                        }
                    }
                    // Increment the address.
                    HexRecordSt.Address.Val += 4;
                    // Increment the data pointer.
                    HexRecordSt.Data += 4;
                    // Decrement data len.
                    if(HexRecordSt.RecDataLen > 3)
                    {
                        HexRecordSt.RecDataLen -= 4;
                    }
                    else
                    {
                        HexRecordSt.RecDataLen = 0;
                    }
                }
                break;
        case EXT_SEG_ADRS_RECORD:  // Record Type 02, defines 4th to 19th bits of the data address.
            HexRecordSt.ExtSegAddress.byte.MB = 0;
            HexRecordSt.ExtSegAddress.byte.UB = HexRecordSt.Data[0];
            HexRecordSt.ExtSegAddress.byte.HB = HexRecordSt.Data[1];
            HexRecordSt.ExtSegAddress.byte.LB = 0;
            // Reset linear address.
            HexRecordSt.ExtLinAddress.Val = 0;
            break;
        case EXT_LIN_ADRS_RECORD:   // Record Type 04, defines 16th to 31st bits of the data address.
            HexRecordSt.ExtLinAddress.byte.MB = HexRecordSt.Data[0];
            HexRecordSt.ExtLinAddress.byte.UB = HexRecordSt.Data[1];
            HexRecordSt.ExtLinAddress.byte.HB = 0;
            HexRecordSt.ExtLinAddress.byte.LB = 0;
            // Reset segment address.
            HexRecordSt.ExtSegAddress.Val = 0;
            break;
        case END_OF_FILE_RECORD:  //Record Type 01, defines the end of file record.
            HexRecordSt.ExtSegAddress.Val = 0;
            HexRecordSt.ExtLinAddress.Val = 0;
            return 1; /* Listo para saltar a la APP */
            break;
        default:
            HexRecordSt.ExtSegAddress.Val = 0;
            HexRecordSt.ExtLinAddress.Val = 0;
            break;
        }
    }
    return 0;
}	

