wpirri/pic32mmBoot/Programa/main.c
/********************************************************************
* Function: 	ValidAppPresent()
*
* Precondition: 
*
* Input: 		None.
*
* Output:		TRUE: If application is valid.
*
* Side Effects:	None.
*
* Overview: 	Logic: Check application vector has 
				some value other than "0xFFFFFF"
*
*			
* Note:		 	None.
********************************************************************/
BOOL ValidAppPresent(void)
{
	if(FLASH_ReadWord(USER_APP_RESET_ADDRESS) == 0xFFFFFFFF)
	{
		return FALSE;
	}
	else
	{
		return TRUE;
	}
}			

/********************************************************************
* Function: 	readLine()
*
* Precondition:
*
* Input:
*
* Output:
*
* Side Effects:	None.
*
* Overview:
*
*
* Note:
********************************************************************/
int readLine(void *ptr, size_t max_len, FSFILE *stream)
{
    int len = 0;
    char *p;
    int rec_len;

    p = ptr;

    while(FSfread(p,1,1,stream))
    {
        if(*p != 0x0d && *p != 0x0a) break;
    }
    
    /* Verifico que sea el inicio de l?nea */
    if(*p != ':') return 0;
    /* Avanzo el puntero */
    p++;
    len++;
    /* Leo el tipo de registro */
    FSfread(p,1,2,stream);
    p[2] = 0;
    /* Segun el tipo de registro me cargo el tama?o */
    switch((int)strtol(p, NULL, 16))
    {
        case 0x00:
            rec_len = 11;
            break;
        case 0x02:
            rec_len = 15;
            break;
        case 0x04:
            rec_len = 19;
            break;
        case 0x08:
            rec_len = 27;
            break;
        case 0x0c:
            rec_len = 35;
            break;
        case 0x10:
            rec_len = 43;
            break;
        default:
            return 0;
    }
    /* Avanzo el puntero */
    p += 2;
    len += 2;
    /* le saco los 3 caracteres ya leidos leidos */
    rec_len -= 3;
    /* Le agrego uno para que quede adentro el linefeed */
    rec_len += 1;
    /* si es un tipo de registro conocido leo todo el registro de una */
    if(FSfread(p,1,rec_len,stream) != rec_len) return 0;
    p[rec_len] = 0x00;
    len += rec_len;
    return len;
}

/********************************************************************
 *
 ********************************************************************/
int CheckHexRecord(UINT8* HexRecord)
{
    UINT8 Checksum = 0;
    UINT8 RecDataLen = 0;
    UINT8 i;

    // Hex Record checksum check.
    for(i = 0; i < RecDataLen + 5; i++)
    {
            Checksum += HexRecord[i];
    }

    if(Checksum != 0)
    {
        /* Error de checksum en un registro */
        return 0;
    }
    else
    {
        // Hex record checksum OK.
        switch(HexRecord[3])
        {
            case DATA_RECORD:  //Record Type 00, data record.
                break;
        case EXT_SEG_ADRS_RECORD:  // Record Type 02, defines 4th to 19th bits of the data address.
            break;
        case EXT_LIN_ADRS_RECORD:   // Record Type 04, defines 16th to 31st bits of the data address.
            break;
        case END_OF_FILE_RECORD:  //Record Type 01, defines the end of file record.
            return 1; /* Listo para saltar a la APP */
            break;
        default:
            break;
        }
    }
    /* Le falta el record final */
    return 0;
}
